HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN26 */
#define IFX_ERAY_ACCEN0_EN26_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN26 */
#define IFX_ERAY_ACCEN0_EN26_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN26 */
#define IFX_ERAY_ACCEN0_EN26_OFF (26)

/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN27 */
#define IFX_ERAY_ACCEN0_EN27_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN27 */
#define IFX_ERAY_ACCEN0_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN27 */
#define IFX_ERAY_ACCEN0_EN27_OFF (27)

/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN28 */
#define IFX_ERAY_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN28 */
#define IFX_ERAY_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN28 */
#define IFX_ERAY_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN29 */
#define IFX_ERAY_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN29 */
#define IFX_ERAY_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN29 */
#define IFX_ERAY_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN2 */
#define IFX_ERAY_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN2 */
#define IFX_ERAY_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN2 */
#define IFX_ERAY_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN30 */
#define IFX_ERAY_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN30 */
#define IFX_ERAY_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN30 */
#define IFX_ERAY_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN31 */
#define IFX_ERAY_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN31 */
#define IFX_ERAY_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN31 */
#define IFX_ERAY_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN3 */
#define IFX_ERAY_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN3 */
#define IFX_ERAY_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN3 */
#define IFX_ERAY_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN4 */
#define IFX_ERAY_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN4 */
#define IFX_ERAY_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN4 */
#define IFX_ERAY_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN5 */
#define IFX_ERAY_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN5 */
#define IFX_ERAY_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN5 */
#define IFX_ERAY_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN6 */
#define IFX_ERAY_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN6 */
#define IFX_ERAY_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN6 */
#define IFX_ERAY_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN7 */
#define IFX_ERAY_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN7 */
#define IFX_ERAY_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN7 */
#define IFX_ERAY_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN8 */
#define IFX_ERAY_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN8 */
#define IFX_ERAY_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN8 */
#define IFX_ERAY_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_ERAY_ACCEN0_Bits.EN9 */
#define IFX_ERAY_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACCEN0_Bits.EN9 */
#define IFX_ERAY_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACCEN0_Bits.EN9 */
#define IFX_ERAY_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_ERAY_ACS_Bits.CEDA */
#define IFX_ERAY_ACS_CEDA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACS_Bits.CEDA */
#define IFX_ERAY_ACS_CEDA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACS_Bits.CEDA */
#define IFX_ERAY_ACS_CEDA_OFF (2)

/** \\brief  Length for Ifx_ERAY_ACS_Bits.CEDB */
#define IFX_ERAY_ACS_CEDB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACS_Bits.CEDB */
#define IFX_ERAY_ACS_CEDB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACS_Bits.CEDB */
#define IFX_ERAY_ACS_CEDB_OFF (10)

/** \\brief  Length for Ifx_ERAY_ACS_Bits.CIA */
#define IFX_ERAY_ACS_CIA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACS_Bits.CIA */
#define IFX_ERAY_ACS_CIA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACS_Bits.CIA */
#define IFX_ERAY_ACS_CIA_OFF (3)

/** \\brief  Length for Ifx_ERAY_ACS_Bits.CIB */
#define IFX_ERAY_ACS_CIB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACS_Bits.CIB */
#define IFX_ERAY_ACS_CIB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACS_Bits.CIB */
#define IFX_ERAY_ACS_CIB_OFF (11)

/** \\brief  Length for Ifx_ERAY_ACS_Bits.SBVA */
#define IFX_ERAY_ACS_SBVA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACS_Bits.SBVA */
#define IFX_ERAY_ACS_SBVA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACS_Bits.SBVA */
#define IFX_ERAY_ACS_SBVA_OFF (4)

/** \\brief  Length for Ifx_ERAY_ACS_Bits.SBVB */
#define IFX_ERAY_ACS_SBVB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACS_Bits.SBVB */
#define IFX_ERAY_ACS_SBVB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACS_Bits.SBVB */
#define IFX_ERAY_ACS_SBVB_OFF (12)

/** \\brief  Length for Ifx_ERAY_ACS_Bits.SEDA */
#define IFX_ERAY_ACS_SEDA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACS_Bits.SEDA */
#define IFX_ERAY_ACS_SEDA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACS_Bits.SEDA */
#define IFX_ERAY_ACS_SEDA_OFF (1)

/** \\brief  Length for Ifx_ERAY_ACS_Bits.SEDB */
#define IFX_ERAY_ACS_SEDB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACS_Bits.SEDB */
#define IFX_ERAY_ACS_SEDB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACS_Bits.SEDB */
#define IFX_ERAY_ACS_SEDB_OFF (9)

/** \\brief  Length for Ifx_ERAY_ACS_Bits.VFRA */
#define IFX_ERAY_ACS_VFRA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACS_Bits.VFRA */
#define IFX_ERAY_ACS_VFRA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ACS_Bits.VFRA */
#define IFX_ERAY_ACS_VFRA_OFF (0)

/** \\brief  Length for Ifx_ERAY_ACS_Bits.VFRB */
#define IFX_ERAY_ACS_VFRB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ACS_Bits.VFRB */
#define IFX_ERAY_ACS_VFRB_MSK (0x1)

