HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEray_bf.h
/** \\brief  Mask for Ifx_ERAY_FSR_Bits.RFNE */
#define IFX_ERAY_FSR_RFNE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_FSR_Bits.RFNE */
#define IFX_ERAY_FSR_RFNE_OFF (0)

/** \\brief  Length for Ifx_ERAY_FSR_Bits.RFO */
#define IFX_ERAY_FSR_RFO_LEN (1)

/** \\brief  Mask for Ifx_ERAY_FSR_Bits.RFO */
#define IFX_ERAY_FSR_RFO_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_FSR_Bits.RFO */
#define IFX_ERAY_FSR_RFO_OFF (2)

/** \\brief  Length for Ifx_ERAY_GTUC01_Bits.UT */
#define IFX_ERAY_GTUC01_UT_LEN (20)

/** \\brief  Mask for Ifx_ERAY_GTUC01_Bits.UT */
#define IFX_ERAY_GTUC01_UT_MSK (0xfffff)

/** \\brief  Offset for Ifx_ERAY_GTUC01_Bits.UT */
#define IFX_ERAY_GTUC01_UT_OFF (0)

/** \\brief  Length for Ifx_ERAY_GTUC02_Bits.MPC */
#define IFX_ERAY_GTUC02_MPC_LEN (14)

/** \\brief  Mask for Ifx_ERAY_GTUC02_Bits.MPC */
#define IFX_ERAY_GTUC02_MPC_MSK (0x3fff)

/** \\brief  Offset for Ifx_ERAY_GTUC02_Bits.MPC */
#define IFX_ERAY_GTUC02_MPC_OFF (0)

/** \\brief  Length for Ifx_ERAY_GTUC02_Bits.SNM */
#define IFX_ERAY_GTUC02_SNM_LEN (4)

/** \\brief  Mask for Ifx_ERAY_GTUC02_Bits.SNM */
#define IFX_ERAY_GTUC02_SNM_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_GTUC02_Bits.SNM */
#define IFX_ERAY_GTUC02_SNM_OFF (16)

/** \\brief  Length for Ifx_ERAY_GTUC03_Bits.MIOA */
#define IFX_ERAY_GTUC03_MIOA_LEN (7)

/** \\brief  Mask for Ifx_ERAY_GTUC03_Bits.MIOA */
#define IFX_ERAY_GTUC03_MIOA_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_GTUC03_Bits.MIOA */
#define IFX_ERAY_GTUC03_MIOA_OFF (16)

/** \\brief  Length for Ifx_ERAY_GTUC03_Bits.MIOB */
#define IFX_ERAY_GTUC03_MIOB_LEN (7)

/** \\brief  Mask for Ifx_ERAY_GTUC03_Bits.MIOB */
#define IFX_ERAY_GTUC03_MIOB_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_GTUC03_Bits.MIOB */
#define IFX_ERAY_GTUC03_MIOB_OFF (24)

/** \\brief  Length for Ifx_ERAY_GTUC03_Bits.UIOA */
#define IFX_ERAY_GTUC03_UIOA_LEN (8)

/** \\brief  Mask for Ifx_ERAY_GTUC03_Bits.UIOA */
#define IFX_ERAY_GTUC03_UIOA_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_GTUC03_Bits.UIOA */
#define IFX_ERAY_GTUC03_UIOA_OFF (0)

/** \\brief  Length for Ifx_ERAY_GTUC03_Bits.UIOB */
#define IFX_ERAY_GTUC03_UIOB_LEN (8)

/** \\brief  Mask for Ifx_ERAY_GTUC03_Bits.UIOB */
#define IFX_ERAY_GTUC03_UIOB_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_GTUC03_Bits.UIOB */
#define IFX_ERAY_GTUC03_UIOB_OFF (8)

/** \\brief  Length for Ifx_ERAY_GTUC04_Bits.NIT */
#define IFX_ERAY_GTUC04_NIT_LEN (14)

/** \\brief  Mask for Ifx_ERAY_GTUC04_Bits.NIT */
#define IFX_ERAY_GTUC04_NIT_MSK (0x3fff)

/** \\brief  Offset for Ifx_ERAY_GTUC04_Bits.NIT */
#define IFX_ERAY_GTUC04_NIT_OFF (0)

/** \\brief  Length for Ifx_ERAY_GTUC04_Bits.OCS */
#define IFX_ERAY_GTUC04_OCS_LEN (14)

/** \\brief  Mask for Ifx_ERAY_GTUC04_Bits.OCS */
#define IFX_ERAY_GTUC04_OCS_MSK (0x3fff)

/** \\brief  Offset for Ifx_ERAY_GTUC04_Bits.OCS */
#define IFX_ERAY_GTUC04_OCS_OFF (16)

/** \\brief  Length for Ifx_ERAY_GTUC05_Bits.CDD */
#define IFX_ERAY_GTUC05_CDD_LEN (5)

/** \\brief  Mask for Ifx_ERAY_GTUC05_Bits.CDD */
#define IFX_ERAY_GTUC05_CDD_MSK (0x1f)

/** \\brief  Offset for Ifx_ERAY_GTUC05_Bits.CDD */
#define IFX_ERAY_GTUC05_CDD_OFF (16)

/** \\brief  Length for Ifx_ERAY_GTUC05_Bits.DCA */
#define IFX_ERAY_GTUC05_DCA_LEN (8)

/** \\brief  Mask for Ifx_ERAY_GTUC05_Bits.DCA */
#define IFX_ERAY_GTUC05_DCA_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_GTUC05_Bits.DCA */
#define IFX_ERAY_GTUC05_DCA_OFF (0)

/** \\brief  Length for Ifx_ERAY_GTUC05_Bits.DCB */
#define IFX_ERAY_GTUC05_DCB_LEN (8)

/** \\brief  Mask for Ifx_ERAY_GTUC05_Bits.DCB */
#define IFX_ERAY_GTUC05_DCB_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_GTUC05_Bits.DCB */
#define IFX_ERAY_GTUC05_DCB_OFF (8)

/** \\brief  Length for Ifx_ERAY_GTUC05_Bits.DEC */
#define IFX_ERAY_GTUC05_DEC_LEN (8)

/** \\brief  Mask for Ifx_ERAY_GTUC05_Bits.DEC */
#define IFX_ERAY_GTUC05_DEC_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_GTUC05_Bits.DEC */
#define IFX_ERAY_GTUC05_DEC_OFF (24)

/** \\brief  Length for Ifx_ERAY_GTUC06_Bits.ASR */
#define IFX_ERAY_GTUC06_ASR_LEN (11)

/** \\brief  Mask for Ifx_ERAY_GTUC06_Bits.ASR */
#define IFX_ERAY_GTUC06_ASR_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_GTUC06_Bits.ASR */
#define IFX_ERAY_GTUC06_ASR_OFF (0)

/** \\brief  Length for Ifx_ERAY_GTUC06_Bits.MOD */
#define IFX_ERAY_GTUC06_MOD_LEN (11)

/** \\brief  Mask for Ifx_ERAY_GTUC06_Bits.MOD */
#define IFX_ERAY_GTUC06_MOD_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_GTUC06_Bits.MOD */
#define IFX_ERAY_GTUC06_MOD_OFF (16)

/** \\brief  Length for Ifx_ERAY_GTUC07_Bits.NSS */
#define IFX_ERAY_GTUC07_NSS_LEN (10)

/** \\brief  Mask for Ifx_ERAY_GTUC07_Bits.NSS */
#define IFX_ERAY_GTUC07_NSS_MSK (0x3ff)

/** \\brief  Offset for Ifx_ERAY_GTUC07_Bits.NSS */
#define IFX_ERAY_GTUC07_NSS_OFF (16)

/** \\brief  Length for Ifx_ERAY_GTUC07_Bits.SSL */
#define IFX_ERAY_GTUC07_SSL_LEN (10)

/** \\brief  Mask for Ifx_ERAY_GTUC07_Bits.SSL */
#define IFX_ERAY_GTUC07_SSL_MSK (0x3ff)

/** \\brief  Offset for Ifx_ERAY_GTUC07_Bits.SSL */
#define IFX_ERAY_GTUC07_SSL_OFF (0)

/** \\brief  Length for Ifx_ERAY_GTUC08_Bits.MSL */
#define IFX_ERAY_GTUC08_MSL_LEN (6)

/** \\brief  Mask for Ifx_ERAY_GTUC08_Bits.MSL */
#define IFX_ERAY_GTUC08_MSL_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_GTUC08_Bits.MSL */
#define IFX_ERAY_GTUC08_MSL_OFF (0)

/** \\brief  Length for Ifx_ERAY_GTUC08_Bits.NMS */
#define IFX_ERAY_GTUC08_NMS_LEN (13)

/** \\brief  Mask for Ifx_ERAY_GTUC08_Bits.NMS */
#define IFX_ERAY_GTUC08_NMS_MSK (0x1fff)

/** \\brief  Offset for Ifx_ERAY_GTUC08_Bits.NMS */
#define IFX_ERAY_GTUC08_NMS_OFF (16)

/** \\brief  Length for Ifx_ERAY_GTUC09_Bits.APO */
#define IFX_ERAY_GTUC09_APO_LEN (6)

/** \\brief  Mask for Ifx_ERAY_GTUC09_Bits.APO */
#define IFX_ERAY_GTUC09_APO_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_GTUC09_Bits.APO */
#define IFX_ERAY_GTUC09_APO_OFF (0)

/** \\brief  Length for Ifx_ERAY_GTUC09_Bits.DSI */
#define IFX_ERAY_GTUC09_DSI_LEN (2)

/** \\brief  Mask for Ifx_ERAY_GTUC09_Bits.DSI */
#define IFX_ERAY_GTUC09_DSI_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_GTUC09_Bits.DSI */
#define IFX_ERAY_GTUC09_DSI_OFF (16)

/** \\brief  Length for Ifx_ERAY_GTUC09_Bits.MAPO */
#define IFX_ERAY_GTUC09_MAPO_LEN (5)

/** \\brief  Mask for Ifx_ERAY_GTUC09_Bits.MAPO */
#define IFX_ERAY_GTUC09_MAPO_MSK (0x1f)

/** \\brief  Offset for Ifx_ERAY_GTUC09_Bits.MAPO */
#define IFX_ERAY_GTUC09_MAPO_OFF (8)

/** \\brief  Length for Ifx_ERAY_GTUC10_Bits.MOC */
#define IFX_ERAY_GTUC10_MOC_LEN (14)

