HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEray_bf.h
/** \\brief  Mask for Ifx_ERAY_GTUC10_Bits.MOC */
#define IFX_ERAY_GTUC10_MOC_MSK (0x3fff)

/** \\brief  Offset for Ifx_ERAY_GTUC10_Bits.MOC */
#define IFX_ERAY_GTUC10_MOC_OFF (0)

/** \\brief  Length for Ifx_ERAY_GTUC10_Bits.MRC */
#define IFX_ERAY_GTUC10_MRC_LEN (11)

/** \\brief  Mask for Ifx_ERAY_GTUC10_Bits.MRC */
#define IFX_ERAY_GTUC10_MRC_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_GTUC10_Bits.MRC */
#define IFX_ERAY_GTUC10_MRC_OFF (16)

/** \\brief  Length for Ifx_ERAY_GTUC11_Bits.EOC */
#define IFX_ERAY_GTUC11_EOC_LEN (3)

/** \\brief  Mask for Ifx_ERAY_GTUC11_Bits.EOC */
#define IFX_ERAY_GTUC11_EOC_MSK (0x7)

/** \\brief  Offset for Ifx_ERAY_GTUC11_Bits.EOC */
#define IFX_ERAY_GTUC11_EOC_OFF (16)

/** \\brief  Length for Ifx_ERAY_GTUC11_Bits.EOCC */
#define IFX_ERAY_GTUC11_EOCC_LEN (2)

/** \\brief  Mask for Ifx_ERAY_GTUC11_Bits.EOCC */
#define IFX_ERAY_GTUC11_EOCC_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_GTUC11_Bits.EOCC */
#define IFX_ERAY_GTUC11_EOCC_OFF (0)

/** \\brief  Length for Ifx_ERAY_GTUC11_Bits.ERC */
#define IFX_ERAY_GTUC11_ERC_LEN (3)

/** \\brief  Mask for Ifx_ERAY_GTUC11_Bits.ERC */
#define IFX_ERAY_GTUC11_ERC_MSK (0x7)

/** \\brief  Offset for Ifx_ERAY_GTUC11_Bits.ERC */
#define IFX_ERAY_GTUC11_ERC_OFF (24)

/** \\brief  Length for Ifx_ERAY_GTUC11_Bits.ERCC */
#define IFX_ERAY_GTUC11_ERCC_LEN (2)

/** \\brief  Mask for Ifx_ERAY_GTUC11_Bits.ERCC */
#define IFX_ERAY_GTUC11_ERCC_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_GTUC11_Bits.ERCC */
#define IFX_ERAY_GTUC11_ERCC_OFF (8)

/** \\brief  Length for Ifx_ERAY_IBCM_Bits.LDSH */
#define IFX_ERAY_IBCM_LDSH_LEN (1)

/** \\brief  Mask for Ifx_ERAY_IBCM_Bits.LDSH */
#define IFX_ERAY_IBCM_LDSH_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_IBCM_Bits.LDSH */
#define IFX_ERAY_IBCM_LDSH_OFF (1)

/** \\brief  Length for Ifx_ERAY_IBCM_Bits.LDSS */
#define IFX_ERAY_IBCM_LDSS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_IBCM_Bits.LDSS */
#define IFX_ERAY_IBCM_LDSS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_IBCM_Bits.LDSS */
#define IFX_ERAY_IBCM_LDSS_OFF (17)

/** \\brief  Length for Ifx_ERAY_IBCM_Bits.LHSH */
#define IFX_ERAY_IBCM_LHSH_LEN (1)

/** \\brief  Mask for Ifx_ERAY_IBCM_Bits.LHSH */
#define IFX_ERAY_IBCM_LHSH_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_IBCM_Bits.LHSH */
#define IFX_ERAY_IBCM_LHSH_OFF (0)

/** \\brief  Length for Ifx_ERAY_IBCM_Bits.LHSS */
#define IFX_ERAY_IBCM_LHSS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_IBCM_Bits.LHSS */
#define IFX_ERAY_IBCM_LHSS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_IBCM_Bits.LHSS */
#define IFX_ERAY_IBCM_LHSS_OFF (16)

/** \\brief  Length for Ifx_ERAY_IBCM_Bits.STXRH */
#define IFX_ERAY_IBCM_STXRH_LEN (1)

/** \\brief  Mask for Ifx_ERAY_IBCM_Bits.STXRH */
#define IFX_ERAY_IBCM_STXRH_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_IBCM_Bits.STXRH */
#define IFX_ERAY_IBCM_STXRH_OFF (2)

/** \\brief  Length for Ifx_ERAY_IBCM_Bits.STXRS */
#define IFX_ERAY_IBCM_STXRS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_IBCM_Bits.STXRS */
#define IFX_ERAY_IBCM_STXRS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_IBCM_Bits.STXRS */
#define IFX_ERAY_IBCM_STXRS_OFF (18)

/** \\brief  Length for Ifx_ERAY_IBCR_Bits.IBRH */
#define IFX_ERAY_IBCR_IBRH_LEN (7)

/** \\brief  Mask for Ifx_ERAY_IBCR_Bits.IBRH */
#define IFX_ERAY_IBCR_IBRH_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_IBCR_Bits.IBRH */
#define IFX_ERAY_IBCR_IBRH_OFF (0)

/** \\brief  Length for Ifx_ERAY_IBCR_Bits.IBRS */
#define IFX_ERAY_IBCR_IBRS_LEN (7)

/** \\brief  Mask for Ifx_ERAY_IBCR_Bits.IBRS */
#define IFX_ERAY_IBCR_IBRS_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_IBCR_Bits.IBRS */
#define IFX_ERAY_IBCR_IBRS_OFF (16)

/** \\brief  Length for Ifx_ERAY_IBCR_Bits.IBSYH */
#define IFX_ERAY_IBCR_IBSYH_LEN (1)

/** \\brief  Mask for Ifx_ERAY_IBCR_Bits.IBSYH */
#define IFX_ERAY_IBCR_IBSYH_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_IBCR_Bits.IBSYH */
#define IFX_ERAY_IBCR_IBSYH_OFF (15)

/** \\brief  Length for Ifx_ERAY_IBCR_Bits.IBSYS */
#define IFX_ERAY_IBCR_IBSYS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_IBCR_Bits.IBSYS */
#define IFX_ERAY_IBCR_IBSYS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_IBCR_Bits.IBSYS */
#define IFX_ERAY_IBCR_IBSYS_OFF (31)

/** \\brief  Length for Ifx_ERAY_ID_Bits.MODNUMBER */
#define IFX_ERAY_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_ERAY_ID_Bits.MODNUMBER */
#define IFX_ERAY_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_ERAY_ID_Bits.MODNUMBER */
#define IFX_ERAY_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_ERAY_ID_Bits.MODREV */
#define IFX_ERAY_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_ERAY_ID_Bits.MODREV */
#define IFX_ERAY_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_ID_Bits.MODREV */
#define IFX_ERAY_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_ERAY_ID_Bits.MODTYPE */
#define IFX_ERAY_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_ERAY_ID_Bits.MODTYPE */
#define IFX_ERAY_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_ID_Bits.MODTYPE */
#define IFX_ERAY_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_ERAY_ILE_Bits.EINT0 */
#define IFX_ERAY_ILE_EINT0_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ILE_Bits.EINT0 */
#define IFX_ERAY_ILE_EINT0_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ILE_Bits.EINT0 */
#define IFX_ERAY_ILE_EINT0_OFF (0)

/** \\brief  Length for Ifx_ERAY_ILE_Bits.EINT1 */
#define IFX_ERAY_ILE_EINT1_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ILE_Bits.EINT1 */
#define IFX_ERAY_ILE_EINT1_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ILE_Bits.EINT1 */
#define IFX_ERAY_ILE_EINT1_OFF (1)

/** \\brief  Length for Ifx_ERAY_KRST0_Bits.RST */
#define IFX_ERAY_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_ERAY_KRST0_Bits.RST */
#define IFX_ERAY_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_KRST0_Bits.RST */
#define IFX_ERAY_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_ERAY_KRST0_Bits.RSTSTAT */
#define IFX_ERAY_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_ERAY_KRST0_Bits.RSTSTAT */
#define IFX_ERAY_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_KRST0_Bits.RSTSTAT */
#define IFX_ERAY_KRST0_RSTSTAT_OFF (1)

