HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEray_bf.h
/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.SNUA */
#define IFX_ERAY_MHDF_SNUA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.SNUA */
#define IFX_ERAY_MHDF_SNUA_OFF (0)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.SNUB */
#define IFX_ERAY_MHDF_SNUB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.SNUB */
#define IFX_ERAY_MHDF_SNUB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.SNUB */
#define IFX_ERAY_MHDF_SNUB_OFF (1)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.TBFA */
#define IFX_ERAY_MHDF_TBFA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.TBFA */
#define IFX_ERAY_MHDF_TBFA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.TBFA */
#define IFX_ERAY_MHDF_TBFA_OFF (4)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.TBFB */
#define IFX_ERAY_MHDF_TBFB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.TBFB */
#define IFX_ERAY_MHDF_TBFB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.TBFB */
#define IFX_ERAY_MHDF_TBFB_OFF (5)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_OFF (6)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_OFF (7)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.WAHP */
#define IFX_ERAY_MHDF_WAHP_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.WAHP */
#define IFX_ERAY_MHDF_WAHP_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.WAHP */
#define IFX_ERAY_MHDF_WAHP_OFF (8)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.CRAM */
#define IFX_ERAY_MHDS_CRAM_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.CRAM */
#define IFX_ERAY_MHDS_CRAM_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.CRAM */
#define IFX_ERAY_MHDS_CRAM_OFF (7)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.EIBF */
#define IFX_ERAY_MHDS_EIBF_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.EIBF */
#define IFX_ERAY_MHDS_EIBF_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.EIBF */
#define IFX_ERAY_MHDS_EIBF_OFF (0)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.EMR */
#define IFX_ERAY_MHDS_EMR_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.EMR */
#define IFX_ERAY_MHDS_EMR_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.EMR */
#define IFX_ERAY_MHDS_EMR_OFF (2)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.EOBF */
#define IFX_ERAY_MHDS_EOBF_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.EOBF */
#define IFX_ERAY_MHDS_EOBF_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.EOBF */
#define IFX_ERAY_MHDS_EOBF_OFF (1)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.ETBF1 */
#define IFX_ERAY_MHDS_ETBF1_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.ETBF1 */
#define IFX_ERAY_MHDS_ETBF1_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.ETBF1 */
#define IFX_ERAY_MHDS_ETBF1_OFF (3)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.ETBF2 */
#define IFX_ERAY_MHDS_ETBF2_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.ETBF2 */
#define IFX_ERAY_MHDS_ETBF2_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.ETBF2 */
#define IFX_ERAY_MHDS_ETBF2_OFF (4)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.FMB */
#define IFX_ERAY_MHDS_FMB_LEN (7)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.FMB */
#define IFX_ERAY_MHDS_FMB_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.FMB */
#define IFX_ERAY_MHDS_FMB_OFF (8)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.FMBD */
#define IFX_ERAY_MHDS_FMBD_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.FMBD */
#define IFX_ERAY_MHDS_FMBD_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.FMBD */
#define IFX_ERAY_MHDS_FMBD_OFF (5)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.MBT */
#define IFX_ERAY_MHDS_MBT_LEN (7)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.MBT */
#define IFX_ERAY_MHDS_MBT_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.MBT */
#define IFX_ERAY_MHDS_MBT_OFF (16)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.MBU */
#define IFX_ERAY_MHDS_MBU_LEN (7)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.MBU */
#define IFX_ERAY_MHDS_MBU_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.MBU */
#define IFX_ERAY_MHDS_MBU_OFF (24)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.MFMB */
#define IFX_ERAY_MHDS_MFMB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.MFMB */
#define IFX_ERAY_MHDS_MFMB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.MFMB */
#define IFX_ERAY_MHDS_MFMB_OFF (6)

/** \\brief  Length for Ifx_ERAY_MRC_Bits.FDB */
#define IFX_ERAY_MRC_FDB_LEN (8)

/** \\brief  Mask for Ifx_ERAY_MRC_Bits.FDB */
#define IFX_ERAY_MRC_FDB_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_MRC_Bits.FDB */
#define IFX_ERAY_MRC_FDB_OFF (0)

/** \\brief  Length for Ifx_ERAY_MRC_Bits.FFB */
#define IFX_ERAY_MRC_FFB_LEN (8)

/** \\brief  Mask for Ifx_ERAY_MRC_Bits.FFB */
#define IFX_ERAY_MRC_FFB_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_MRC_Bits.FFB */
#define IFX_ERAY_MRC_FFB_OFF (8)

/** \\brief  Length for Ifx_ERAY_MRC_Bits.LCB */
#define IFX_ERAY_MRC_LCB_LEN (8)

/** \\brief  Mask for Ifx_ERAY_MRC_Bits.LCB */
#define IFX_ERAY_MRC_LCB_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_MRC_Bits.LCB */
#define IFX_ERAY_MRC_LCB_OFF (16)

/** \\brief  Length for Ifx_ERAY_MRC_Bits.SEC */
#define IFX_ERAY_MRC_SEC_LEN (2)

/** \\brief  Mask for Ifx_ERAY_MRC_Bits.SEC */
#define IFX_ERAY_MRC_SEC_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_MRC_Bits.SEC */
#define IFX_ERAY_MRC_SEC_OFF (24)

/** \\brief  Length for Ifx_ERAY_MRC_Bits.SPLM */
#define IFX_ERAY_MRC_SPLM_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MRC_Bits.SPLM */
#define IFX_ERAY_MRC_SPLM_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MRC_Bits.SPLM */
#define IFX_ERAY_MRC_SPLM_OFF (26)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP0 */
#define IFX_ERAY_MSIC1_MSIP0_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP0 */
#define IFX_ERAY_MSIC1_MSIP0_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP0 */
#define IFX_ERAY_MSIC1_MSIP0_OFF (0)

