HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP45 */
#define IFX_ERAY_MSIC2_MSIP45_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP45 */
#define IFX_ERAY_MSIC2_MSIP45_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP45 */
#define IFX_ERAY_MSIC2_MSIP45_OFF (13)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP46 */
#define IFX_ERAY_MSIC2_MSIP46_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP46 */
#define IFX_ERAY_MSIC2_MSIP46_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP46 */
#define IFX_ERAY_MSIC2_MSIP46_OFF (14)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP47 */
#define IFX_ERAY_MSIC2_MSIP47_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP47 */
#define IFX_ERAY_MSIC2_MSIP47_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP47 */
#define IFX_ERAY_MSIC2_MSIP47_OFF (15)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP48 */
#define IFX_ERAY_MSIC2_MSIP48_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP48 */
#define IFX_ERAY_MSIC2_MSIP48_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP48 */
#define IFX_ERAY_MSIC2_MSIP48_OFF (16)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP49 */
#define IFX_ERAY_MSIC2_MSIP49_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP49 */
#define IFX_ERAY_MSIC2_MSIP49_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP49 */
#define IFX_ERAY_MSIC2_MSIP49_OFF (17)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP50 */
#define IFX_ERAY_MSIC2_MSIP50_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP50 */
#define IFX_ERAY_MSIC2_MSIP50_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP50 */
#define IFX_ERAY_MSIC2_MSIP50_OFF (18)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP51 */
#define IFX_ERAY_MSIC2_MSIP51_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP51 */
#define IFX_ERAY_MSIC2_MSIP51_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP51 */
#define IFX_ERAY_MSIC2_MSIP51_OFF (19)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP52 */
#define IFX_ERAY_MSIC2_MSIP52_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP52 */
#define IFX_ERAY_MSIC2_MSIP52_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP52 */
#define IFX_ERAY_MSIC2_MSIP52_OFF (20)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP53 */
#define IFX_ERAY_MSIC2_MSIP53_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP53 */
#define IFX_ERAY_MSIC2_MSIP53_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP53 */
#define IFX_ERAY_MSIC2_MSIP53_OFF (21)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP54 */
#define IFX_ERAY_MSIC2_MSIP54_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP54 */
#define IFX_ERAY_MSIC2_MSIP54_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP54 */
#define IFX_ERAY_MSIC2_MSIP54_OFF (22)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP55 */
#define IFX_ERAY_MSIC2_MSIP55_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP55 */
#define IFX_ERAY_MSIC2_MSIP55_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP55 */
#define IFX_ERAY_MSIC2_MSIP55_OFF (23)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP56 */
#define IFX_ERAY_MSIC2_MSIP56_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP56 */
#define IFX_ERAY_MSIC2_MSIP56_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP56 */
#define IFX_ERAY_MSIC2_MSIP56_OFF (24)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP57 */
#define IFX_ERAY_MSIC2_MSIP57_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP57 */
#define IFX_ERAY_MSIC2_MSIP57_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP57 */
#define IFX_ERAY_MSIC2_MSIP57_OFF (25)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP58 */
#define IFX_ERAY_MSIC2_MSIP58_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP58 */
#define IFX_ERAY_MSIC2_MSIP58_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP58 */
#define IFX_ERAY_MSIC2_MSIP58_OFF (26)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP59 */
#define IFX_ERAY_MSIC2_MSIP59_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP59 */
#define IFX_ERAY_MSIC2_MSIP59_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP59 */
#define IFX_ERAY_MSIC2_MSIP59_OFF (27)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP60 */
#define IFX_ERAY_MSIC2_MSIP60_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP60 */
#define IFX_ERAY_MSIC2_MSIP60_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP60 */
#define IFX_ERAY_MSIC2_MSIP60_OFF (28)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP61 */
#define IFX_ERAY_MSIC2_MSIP61_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP61 */
#define IFX_ERAY_MSIC2_MSIP61_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP61 */
#define IFX_ERAY_MSIC2_MSIP61_OFF (29)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP62 */
#define IFX_ERAY_MSIC2_MSIP62_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP62 */
#define IFX_ERAY_MSIC2_MSIP62_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP62 */
#define IFX_ERAY_MSIC2_MSIP62_OFF (30)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP63 */
#define IFX_ERAY_MSIC2_MSIP63_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP63 */
#define IFX_ERAY_MSIC2_MSIP63_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP63 */
#define IFX_ERAY_MSIC2_MSIP63_OFF (31)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP64 */
#define IFX_ERAY_MSIC3_MSIP64_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP64 */
#define IFX_ERAY_MSIC3_MSIP64_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP64 */
#define IFX_ERAY_MSIC3_MSIP64_OFF (0)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP65 */
#define IFX_ERAY_MSIC3_MSIP65_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP65 */
#define IFX_ERAY_MSIC3_MSIP65_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP65 */
#define IFX_ERAY_MSIC3_MSIP65_OFF (1)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP66 */
#define IFX_ERAY_MSIC3_MSIP66_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP66 */
#define IFX_ERAY_MSIC3_MSIP66_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP66 */
#define IFX_ERAY_MSIC3_MSIP66_OFF (2)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP67 */
#define IFX_ERAY_MSIC3_MSIP67_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP67 */
#define IFX_ERAY_MSIC3_MSIP67_MSK (0x1)

