HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP67 */
#define IFX_ERAY_MSIC3_MSIP67_OFF (3)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP68 */
#define IFX_ERAY_MSIC3_MSIP68_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP68 */
#define IFX_ERAY_MSIC3_MSIP68_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP68 */
#define IFX_ERAY_MSIC3_MSIP68_OFF (4)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP69 */
#define IFX_ERAY_MSIC3_MSIP69_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP69 */
#define IFX_ERAY_MSIC3_MSIP69_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP69 */
#define IFX_ERAY_MSIC3_MSIP69_OFF (5)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP70 */
#define IFX_ERAY_MSIC3_MSIP70_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP70 */
#define IFX_ERAY_MSIC3_MSIP70_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP70 */
#define IFX_ERAY_MSIC3_MSIP70_OFF (6)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP71 */
#define IFX_ERAY_MSIC3_MSIP71_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP71 */
#define IFX_ERAY_MSIC3_MSIP71_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP71 */
#define IFX_ERAY_MSIC3_MSIP71_OFF (7)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP72 */
#define IFX_ERAY_MSIC3_MSIP72_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP72 */
#define IFX_ERAY_MSIC3_MSIP72_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP72 */
#define IFX_ERAY_MSIC3_MSIP72_OFF (8)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP73 */
#define IFX_ERAY_MSIC3_MSIP73_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP73 */
#define IFX_ERAY_MSIC3_MSIP73_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP73 */
#define IFX_ERAY_MSIC3_MSIP73_OFF (9)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP74 */
#define IFX_ERAY_MSIC3_MSIP74_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP74 */
#define IFX_ERAY_MSIC3_MSIP74_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP74 */
#define IFX_ERAY_MSIC3_MSIP74_OFF (10)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP75 */
#define IFX_ERAY_MSIC3_MSIP75_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP75 */
#define IFX_ERAY_MSIC3_MSIP75_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP75 */
#define IFX_ERAY_MSIC3_MSIP75_OFF (11)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP76 */
#define IFX_ERAY_MSIC3_MSIP76_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP76 */
#define IFX_ERAY_MSIC3_MSIP76_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP76 */
#define IFX_ERAY_MSIC3_MSIP76_OFF (12)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP77 */
#define IFX_ERAY_MSIC3_MSIP77_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP77 */
#define IFX_ERAY_MSIC3_MSIP77_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP77 */
#define IFX_ERAY_MSIC3_MSIP77_OFF (13)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP78 */
#define IFX_ERAY_MSIC3_MSIP78_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP78 */
#define IFX_ERAY_MSIC3_MSIP78_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP78 */
#define IFX_ERAY_MSIC3_MSIP78_OFF (14)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP79 */
#define IFX_ERAY_MSIC3_MSIP79_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP79 */
#define IFX_ERAY_MSIC3_MSIP79_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP79 */
#define IFX_ERAY_MSIC3_MSIP79_OFF (15)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP80 */
#define IFX_ERAY_MSIC3_MSIP80_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP80 */
#define IFX_ERAY_MSIC3_MSIP80_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP80 */
#define IFX_ERAY_MSIC3_MSIP80_OFF (16)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP81 */
#define IFX_ERAY_MSIC3_MSIP81_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP81 */
#define IFX_ERAY_MSIC3_MSIP81_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP81 */
#define IFX_ERAY_MSIC3_MSIP81_OFF (17)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP82 */
#define IFX_ERAY_MSIC3_MSIP82_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP82 */
#define IFX_ERAY_MSIC3_MSIP82_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP82 */
#define IFX_ERAY_MSIC3_MSIP82_OFF (18)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP83 */
#define IFX_ERAY_MSIC3_MSIP83_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP83 */
#define IFX_ERAY_MSIC3_MSIP83_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP83 */
#define IFX_ERAY_MSIC3_MSIP83_OFF (19)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP84 */
#define IFX_ERAY_MSIC3_MSIP84_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP84 */
#define IFX_ERAY_MSIC3_MSIP84_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP84 */
#define IFX_ERAY_MSIC3_MSIP84_OFF (20)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP85 */
#define IFX_ERAY_MSIC3_MSIP85_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP85 */
#define IFX_ERAY_MSIC3_MSIP85_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP85 */
#define IFX_ERAY_MSIC3_MSIP85_OFF (21)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP86 */
#define IFX_ERAY_MSIC3_MSIP86_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP86 */
#define IFX_ERAY_MSIC3_MSIP86_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP86 */
#define IFX_ERAY_MSIC3_MSIP86_OFF (22)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP87 */
#define IFX_ERAY_MSIC3_MSIP87_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP87 */
#define IFX_ERAY_MSIC3_MSIP87_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP87 */
#define IFX_ERAY_MSIC3_MSIP87_OFF (23)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP88 */
#define IFX_ERAY_MSIC3_MSIP88_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP88 */
#define IFX_ERAY_MSIC3_MSIP88_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP88 */
#define IFX_ERAY_MSIC3_MSIP88_OFF (24)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP89 */
#define IFX_ERAY_MSIC3_MSIP89_LEN (1)

