HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_SUCC2_Bits.LT */
#define IFX_ERAY_SUCC2_LT_OFF (0)

/** \\brief  Length for Ifx_ERAY_SUCC2_Bits.LTN */
#define IFX_ERAY_SUCC2_LTN_LEN (4)

/** \\brief  Mask for Ifx_ERAY_SUCC2_Bits.LTN */
#define IFX_ERAY_SUCC2_LTN_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_SUCC2_Bits.LTN */
#define IFX_ERAY_SUCC2_LTN_OFF (24)

/** \\brief  Length for Ifx_ERAY_SUCC3_Bits.WCF */
#define IFX_ERAY_SUCC3_WCF_LEN (4)

/** \\brief  Mask for Ifx_ERAY_SUCC3_Bits.WCF */
#define IFX_ERAY_SUCC3_WCF_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_SUCC3_Bits.WCF */
#define IFX_ERAY_SUCC3_WCF_OFF (4)

/** \\brief  Length for Ifx_ERAY_SUCC3_Bits.WCP */
#define IFX_ERAY_SUCC3_WCP_LEN (4)

/** \\brief  Mask for Ifx_ERAY_SUCC3_Bits.WCP */
#define IFX_ERAY_SUCC3_WCP_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_SUCC3_Bits.WCP */
#define IFX_ERAY_SUCC3_WCP_OFF (0)

/** \\brief  Length for Ifx_ERAY_SWNIT_Bits.MTSA */
#define IFX_ERAY_SWNIT_MTSA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SWNIT_Bits.MTSA */
#define IFX_ERAY_SWNIT_MTSA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SWNIT_Bits.MTSA */
#define IFX_ERAY_SWNIT_MTSA_OFF (6)

/** \\brief  Length for Ifx_ERAY_SWNIT_Bits.MTSB */
#define IFX_ERAY_SWNIT_MTSB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SWNIT_Bits.MTSB */
#define IFX_ERAY_SWNIT_MTSB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SWNIT_Bits.MTSB */
#define IFX_ERAY_SWNIT_MTSB_OFF (7)

/** \\brief  Length for Ifx_ERAY_SWNIT_Bits.SBNA */
#define IFX_ERAY_SWNIT_SBNA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SWNIT_Bits.SBNA */
#define IFX_ERAY_SWNIT_SBNA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SWNIT_Bits.SBNA */
#define IFX_ERAY_SWNIT_SBNA_OFF (9)

/** \\brief  Length for Ifx_ERAY_SWNIT_Bits.SBNB */
#define IFX_ERAY_SWNIT_SBNB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SWNIT_Bits.SBNB */
#define IFX_ERAY_SWNIT_SBNB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SWNIT_Bits.SBNB */
#define IFX_ERAY_SWNIT_SBNB_OFF (11)

/** \\brief  Length for Ifx_ERAY_SWNIT_Bits.SBSA */
#define IFX_ERAY_SWNIT_SBSA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SWNIT_Bits.SBSA */
#define IFX_ERAY_SWNIT_SBSA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SWNIT_Bits.SBSA */
#define IFX_ERAY_SWNIT_SBSA_OFF (1)

/** \\brief  Length for Ifx_ERAY_SWNIT_Bits.SBSB */
#define IFX_ERAY_SWNIT_SBSB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SWNIT_Bits.SBSB */
#define IFX_ERAY_SWNIT_SBSB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SWNIT_Bits.SBSB */
#define IFX_ERAY_SWNIT_SBSB_OFF (4)

/** \\brief  Length for Ifx_ERAY_SWNIT_Bits.SENA */
#define IFX_ERAY_SWNIT_SENA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SWNIT_Bits.SENA */
#define IFX_ERAY_SWNIT_SENA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SWNIT_Bits.SENA */
#define IFX_ERAY_SWNIT_SENA_OFF (8)

/** \\brief  Length for Ifx_ERAY_SWNIT_Bits.SENB */
#define IFX_ERAY_SWNIT_SENB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SWNIT_Bits.SENB */
#define IFX_ERAY_SWNIT_SENB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SWNIT_Bits.SENB */
#define IFX_ERAY_SWNIT_SENB_OFF (10)

/** \\brief  Length for Ifx_ERAY_SWNIT_Bits.SESA */
#define IFX_ERAY_SWNIT_SESA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SWNIT_Bits.SESA */
#define IFX_ERAY_SWNIT_SESA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SWNIT_Bits.SESA */
#define IFX_ERAY_SWNIT_SESA_OFF (0)

/** \\brief  Length for Ifx_ERAY_SWNIT_Bits.SESB */
#define IFX_ERAY_SWNIT_SESB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SWNIT_Bits.SESB */
#define IFX_ERAY_SWNIT_SESB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SWNIT_Bits.SESB */
#define IFX_ERAY_SWNIT_SESB_OFF (3)

/** \\brief  Length for Ifx_ERAY_SWNIT_Bits.TCSA */
#define IFX_ERAY_SWNIT_TCSA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SWNIT_Bits.TCSA */
#define IFX_ERAY_SWNIT_TCSA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SWNIT_Bits.TCSA */
#define IFX_ERAY_SWNIT_TCSA_OFF (2)

/** \\brief  Length for Ifx_ERAY_SWNIT_Bits.TCSB */
#define IFX_ERAY_SWNIT_TCSB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SWNIT_Bits.TCSB */
#define IFX_ERAY_SWNIT_TCSB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SWNIT_Bits.TCSB */
#define IFX_ERAY_SWNIT_TCSB_OFF (5)

/** \\brief  Length for Ifx_ERAY_T0C_Bits.T0CC */
#define IFX_ERAY_T0C_T0CC_LEN (7)

/** \\brief  Mask for Ifx_ERAY_T0C_Bits.T0CC */
#define IFX_ERAY_T0C_T0CC_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_T0C_Bits.T0CC */
#define IFX_ERAY_T0C_T0CC_OFF (8)

/** \\brief  Length for Ifx_ERAY_T0C_Bits.T0MO */
#define IFX_ERAY_T0C_T0MO_LEN (14)

/** \\brief  Mask for Ifx_ERAY_T0C_Bits.T0MO */
#define IFX_ERAY_T0C_T0MO_MSK (0x3fff)

/** \\brief  Offset for Ifx_ERAY_T0C_Bits.T0MO */
#define IFX_ERAY_T0C_T0MO_OFF (16)

/** \\brief  Length for Ifx_ERAY_T0C_Bits.T0MS */
#define IFX_ERAY_T0C_T0MS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_T0C_Bits.T0MS */
#define IFX_ERAY_T0C_T0MS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_T0C_Bits.T0MS */
#define IFX_ERAY_T0C_T0MS_OFF (1)

/** \\brief  Length for Ifx_ERAY_T0C_Bits.T0RC */
#define IFX_ERAY_T0C_T0RC_LEN (1)

/** \\brief  Mask for Ifx_ERAY_T0C_Bits.T0RC */
#define IFX_ERAY_T0C_T0RC_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_T0C_Bits.T0RC */
#define IFX_ERAY_T0C_T0RC_OFF (0)

/** \\brief  Length for Ifx_ERAY_T1C_Bits.T1MC */
#define IFX_ERAY_T1C_T1MC_LEN (14)

/** \\brief  Mask for Ifx_ERAY_T1C_Bits.T1MC */
#define IFX_ERAY_T1C_T1MC_MSK (0x3fff)

/** \\brief  Offset for Ifx_ERAY_T1C_Bits.T1MC */
#define IFX_ERAY_T1C_T1MC_OFF (16)

/** \\brief  Length for Ifx_ERAY_T1C_Bits.T1MS */
#define IFX_ERAY_T1C_T1MS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_T1C_Bits.T1MS */
#define IFX_ERAY_T1C_T1MS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_T1C_Bits.T1MS */
#define IFX_ERAY_T1C_T1MS_OFF (1)

/** \\brief  Length for Ifx_ERAY_T1C_Bits.T1RC */
#define IFX_ERAY_T1C_T1RC_LEN (1)

/** \\brief  Mask for Ifx_ERAY_T1C_Bits.T1RC */
#define IFX_ERAY_T1C_T1RC_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_T1C_Bits.T1RC */
#define IFX_ERAY_T1C_T1RC_OFF (0)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.AOA */
#define IFX_ERAY_TEST1_AOA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.AOA */
#define IFX_ERAY_TEST1_AOA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.AOA */
#define IFX_ERAY_TEST1_AOA_OFF (8)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.AOB */
#define IFX_ERAY_TEST1_AOB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.AOB */
#define IFX_ERAY_TEST1_AOB_MSK (0x1)

