HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR18 */
#define IFX_ERAY_TXRQ1_TXR18_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR18 */
#define IFX_ERAY_TXRQ1_TXR18_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR18 */
#define IFX_ERAY_TXRQ1_TXR18_OFF (18)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR19 */
#define IFX_ERAY_TXRQ1_TXR19_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR19 */
#define IFX_ERAY_TXRQ1_TXR19_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR19 */
#define IFX_ERAY_TXRQ1_TXR19_OFF (19)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR1 */
#define IFX_ERAY_TXRQ1_TXR1_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR1 */
#define IFX_ERAY_TXRQ1_TXR1_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR1 */
#define IFX_ERAY_TXRQ1_TXR1_OFF (1)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR20 */
#define IFX_ERAY_TXRQ1_TXR20_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR20 */
#define IFX_ERAY_TXRQ1_TXR20_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR20 */
#define IFX_ERAY_TXRQ1_TXR20_OFF (20)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR21 */
#define IFX_ERAY_TXRQ1_TXR21_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR21 */
#define IFX_ERAY_TXRQ1_TXR21_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR21 */
#define IFX_ERAY_TXRQ1_TXR21_OFF (21)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR22 */
#define IFX_ERAY_TXRQ1_TXR22_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR22 */
#define IFX_ERAY_TXRQ1_TXR22_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR22 */
#define IFX_ERAY_TXRQ1_TXR22_OFF (22)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR23 */
#define IFX_ERAY_TXRQ1_TXR23_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR23 */
#define IFX_ERAY_TXRQ1_TXR23_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR23 */
#define IFX_ERAY_TXRQ1_TXR23_OFF (23)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR24 */
#define IFX_ERAY_TXRQ1_TXR24_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR24 */
#define IFX_ERAY_TXRQ1_TXR24_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR24 */
#define IFX_ERAY_TXRQ1_TXR24_OFF (24)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR25 */
#define IFX_ERAY_TXRQ1_TXR25_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR25 */
#define IFX_ERAY_TXRQ1_TXR25_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR25 */
#define IFX_ERAY_TXRQ1_TXR25_OFF (25)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR26 */
#define IFX_ERAY_TXRQ1_TXR26_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR26 */
#define IFX_ERAY_TXRQ1_TXR26_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR26 */
#define IFX_ERAY_TXRQ1_TXR26_OFF (26)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR27 */
#define IFX_ERAY_TXRQ1_TXR27_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR27 */
#define IFX_ERAY_TXRQ1_TXR27_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR27 */
#define IFX_ERAY_TXRQ1_TXR27_OFF (27)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR28 */
#define IFX_ERAY_TXRQ1_TXR28_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR28 */
#define IFX_ERAY_TXRQ1_TXR28_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR28 */
#define IFX_ERAY_TXRQ1_TXR28_OFF (28)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR29 */
#define IFX_ERAY_TXRQ1_TXR29_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR29 */
#define IFX_ERAY_TXRQ1_TXR29_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR29 */
#define IFX_ERAY_TXRQ1_TXR29_OFF (29)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR2 */
#define IFX_ERAY_TXRQ1_TXR2_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR2 */
#define IFX_ERAY_TXRQ1_TXR2_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR2 */
#define IFX_ERAY_TXRQ1_TXR2_OFF (2)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR30 */
#define IFX_ERAY_TXRQ1_TXR30_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR30 */
#define IFX_ERAY_TXRQ1_TXR30_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR30 */
#define IFX_ERAY_TXRQ1_TXR30_OFF (30)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR31 */
#define IFX_ERAY_TXRQ1_TXR31_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR31 */
#define IFX_ERAY_TXRQ1_TXR31_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR31 */
#define IFX_ERAY_TXRQ1_TXR31_OFF (31)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR3 */
#define IFX_ERAY_TXRQ1_TXR3_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR3 */
#define IFX_ERAY_TXRQ1_TXR3_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR3 */
#define IFX_ERAY_TXRQ1_TXR3_OFF (3)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR4 */
#define IFX_ERAY_TXRQ1_TXR4_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR4 */
#define IFX_ERAY_TXRQ1_TXR4_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR4 */
#define IFX_ERAY_TXRQ1_TXR4_OFF (4)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR5 */
#define IFX_ERAY_TXRQ1_TXR5_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR5 */
#define IFX_ERAY_TXRQ1_TXR5_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR5 */
#define IFX_ERAY_TXRQ1_TXR5_OFF (5)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR6 */
#define IFX_ERAY_TXRQ1_TXR6_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR6 */
#define IFX_ERAY_TXRQ1_TXR6_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR6 */
#define IFX_ERAY_TXRQ1_TXR6_OFF (6)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR7 */
#define IFX_ERAY_TXRQ1_TXR7_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR7 */
#define IFX_ERAY_TXRQ1_TXR7_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR7 */
#define IFX_ERAY_TXRQ1_TXR7_OFF (7)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR8 */
#define IFX_ERAY_TXRQ1_TXR8_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR8 */
#define IFX_ERAY_TXRQ1_TXR8_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR8 */
#define IFX_ERAY_TXRQ1_TXR8_OFF (8)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR9 */
#define IFX_ERAY_TXRQ1_TXR9_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR9 */
#define IFX_ERAY_TXRQ1_TXR9_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR9 */
#define IFX_ERAY_TXRQ1_TXR9_OFF (9)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR32 */
#define IFX_ERAY_TXRQ2_TXR32_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR32 */
#define IFX_ERAY_TXRQ2_TXR32_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR32 */
#define IFX_ERAY_TXRQ2_TXR32_OFF (0)

