HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR97 */
#define IFX_ERAY_TXRQ4_TXR97_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR97 */
#define IFX_ERAY_TXRQ4_TXR97_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR97 */
#define IFX_ERAY_TXRQ4_TXR97_OFF (1)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR98 */
#define IFX_ERAY_TXRQ4_TXR98_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR98 */
#define IFX_ERAY_TXRQ4_TXR98_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR98 */
#define IFX_ERAY_TXRQ4_TXR98_OFF (2)

/** \\brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR99 */
#define IFX_ERAY_TXRQ4_TXR99_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR99 */
#define IFX_ERAY_TXRQ4_TXR99_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR99 */
#define IFX_ERAY_TXRQ4_TXR99_OFF (3)

/** \\brief  Length for Ifx_ERAY_WRDS_Bits.MDWB0 */
#define IFX_ERAY_WRDS_MDWB0_LEN (8)

/** \\brief  Mask for Ifx_ERAY_WRDS_Bits.MDWB0 */
#define IFX_ERAY_WRDS_MDWB0_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_WRDS_Bits.MDWB0 */
#define IFX_ERAY_WRDS_MDWB0_OFF (0)

/** \\brief  Length for Ifx_ERAY_WRDS_Bits.MDWB1 */
#define IFX_ERAY_WRDS_MDWB1_LEN (8)

/** \\brief  Mask for Ifx_ERAY_WRDS_Bits.MDWB1 */
#define IFX_ERAY_WRDS_MDWB1_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_WRDS_Bits.MDWB1 */
#define IFX_ERAY_WRDS_MDWB1_OFF (8)

/** \\brief  Length for Ifx_ERAY_WRDS_Bits.MDWB2 */
#define IFX_ERAY_WRDS_MDWB2_LEN (8)

/** \\brief  Mask for Ifx_ERAY_WRDS_Bits.MDWB2 */
#define IFX_ERAY_WRDS_MDWB2_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_WRDS_Bits.MDWB2 */
#define IFX_ERAY_WRDS_MDWB2_OFF (16)

/** \\brief  Length for Ifx_ERAY_WRDS_Bits.MDWB3 */
#define IFX_ERAY_WRDS_MDWB3_LEN (8)

/** \\brief  Mask for Ifx_ERAY_WRDS_Bits.MDWB3 */
#define IFX_ERAY_WRDS_MDWB3_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_WRDS_Bits.MDWB3 */
#define IFX_ERAY_WRDS_MDWB3_OFF (24)

/** \\brief  Length for Ifx_ERAY_WRHS1_Bits.CFG */
#define IFX_ERAY_WRHS1_CFG_LEN (1)

/** \\brief  Mask for Ifx_ERAY_WRHS1_Bits.CFG */
#define IFX_ERAY_WRHS1_CFG_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_WRHS1_Bits.CFG */
#define IFX_ERAY_WRHS1_CFG_OFF (26)

/** \\brief  Length for Ifx_ERAY_WRHS1_Bits.CHA */
#define IFX_ERAY_WRHS1_CHA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_WRHS1_Bits.CHA */
#define IFX_ERAY_WRHS1_CHA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_WRHS1_Bits.CHA */
#define IFX_ERAY_WRHS1_CHA_OFF (24)

/** \\brief  Length for Ifx_ERAY_WRHS1_Bits.CHB */
#define IFX_ERAY_WRHS1_CHB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_WRHS1_Bits.CHB */
#define IFX_ERAY_WRHS1_CHB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_WRHS1_Bits.CHB */
#define IFX_ERAY_WRHS1_CHB_OFF (25)

/** \\brief  Length for Ifx_ERAY_WRHS1_Bits.CYC */
#define IFX_ERAY_WRHS1_CYC_LEN (7)

/** \\brief  Mask for Ifx_ERAY_WRHS1_Bits.CYC */
#define IFX_ERAY_WRHS1_CYC_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_WRHS1_Bits.CYC */
#define IFX_ERAY_WRHS1_CYC_OFF (16)

/** \\brief  Length for Ifx_ERAY_WRHS1_Bits.FID */
#define IFX_ERAY_WRHS1_FID_LEN (11)

/** \\brief  Mask for Ifx_ERAY_WRHS1_Bits.FID */
#define IFX_ERAY_WRHS1_FID_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_WRHS1_Bits.FID */
#define IFX_ERAY_WRHS1_FID_OFF (0)

/** \\brief  Length for Ifx_ERAY_WRHS1_Bits.MBI */
#define IFX_ERAY_WRHS1_MBI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_WRHS1_Bits.MBI */
#define IFX_ERAY_WRHS1_MBI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_WRHS1_Bits.MBI */
#define IFX_ERAY_WRHS1_MBI_OFF (29)

/** \\brief  Length for Ifx_ERAY_WRHS1_Bits.PPIT */
#define IFX_ERAY_WRHS1_PPIT_LEN (1)

/** \\brief  Mask for Ifx_ERAY_WRHS1_Bits.PPIT */
#define IFX_ERAY_WRHS1_PPIT_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_WRHS1_Bits.PPIT */
#define IFX_ERAY_WRHS1_PPIT_OFF (27)

/** \\brief  Length for Ifx_ERAY_WRHS1_Bits.TXM */
#define IFX_ERAY_WRHS1_TXM_LEN (1)

/** \\brief  Mask for Ifx_ERAY_WRHS1_Bits.TXM */
#define IFX_ERAY_WRHS1_TXM_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_WRHS1_Bits.TXM */
#define IFX_ERAY_WRHS1_TXM_OFF (28)

/** \\brief  Length for Ifx_ERAY_WRHS2_Bits.CRC */
#define IFX_ERAY_WRHS2_CRC_LEN (11)

/** \\brief  Mask for Ifx_ERAY_WRHS2_Bits.CRC */
#define IFX_ERAY_WRHS2_CRC_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_WRHS2_Bits.CRC */
#define IFX_ERAY_WRHS2_CRC_OFF (0)

/** \\brief  Length for Ifx_ERAY_WRHS2_Bits.PLC */
#define IFX_ERAY_WRHS2_PLC_LEN (7)

/** \\brief  Mask for Ifx_ERAY_WRHS2_Bits.PLC */
#define IFX_ERAY_WRHS2_PLC_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_WRHS2_Bits.PLC */
#define IFX_ERAY_WRHS2_PLC_OFF (16)

/** \\brief  Length for Ifx_ERAY_WRHS3_Bits.DP */
#define IFX_ERAY_WRHS3_DP_LEN (11)

/** \\brief  Mask for Ifx_ERAY_WRHS3_Bits.DP */
#define IFX_ERAY_WRHS3_DP_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_WRHS3_Bits.DP */
#define IFX_ERAY_WRHS3_DP_OFF (0)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXERAY_BF_H */
